Reports/УДАЛИТЬ_ИсполнениеПланаПродажТехнологовЗамера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>УДАЛИТЬ_ИсполнениеПланаПродажТехнологовЗамера</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технолог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/УДАЛИТЬ_ИсполнениеПланаПродажТехнологовЗамера/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьСписокМесяцев(Год)
	
	СписокМесяцев = Новый СписокЗначений;
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,1,1,0,0,1)),"Январь");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,2,1,0,0,1)),"Февраль");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,3,1,0,0,1)),"Март");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,4,1,0,0,1)),"Апрель");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,5,1,0,0,1)),"Май");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,6,1,0,0,1)),"Июнь");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,7,1,0,0,1)),"Июль");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,8,1,0,0,1)),"Август");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,9,1,0,0,1)),"Сентябрь");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,10,1,0,0,1)),"Октябрь");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,11,1,0,0,1)),"Ноябрь");
	СписокМесяцев.Добавить(НачалоМесяца(Дата(Год,12,1,0,0,1)),"Декабрь");
	
	Возврат СписокМесяцев;
	
КонецФункции

&НаСервере
Функция СформироватьНаСервере()
	
	ТекОбъект = ЭтаФорма.РеквизитФормыВЗначение("Отчет");
	Макет = ТекОбъект.ПолучитьМакет("Макет");
	Возврат МодульОтчетов.СформироватьОтчетИсполнениеПланаПродажТехнологовЗамера(Макет, Отчет.Год, Отчет.Месяц, Отчет.Технолог);
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Если Отчет.Месяц = Дата("00010101") Тогда
		Сообщить("Месяц отчета не выбран");
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Год = Год(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборМесяца(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Отчет.Месяц = ВыбранныйЭлемент.Значение;
	Элементы.ДекорацияМесяц.Заголовок = "Месяц: " + Формат(Отчет.Месяц,"ДФ=ММММ");
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц(Команда)
	СписокВариантов = ПолучитьСписокМесяцев(Отчет.Год);
		
	Оп = Новый ОписаниеОповещения("ВыборМесяца", ЭтаФорма);
	ПоказатьВыборИзМеню(Оп, СписокВариантов, Элементы.ВыбратьМесяц);
КонецПроцедуры

&НаКлиенте
Процедура ГодПланаПриИзменении(Элемент)
	Отчет.Месяц = Дата("00010101");
	Элементы.ДекорацияМесяц.Заголовок = "Месяц не выбран";
КонецПроцедуры
